#ifndef __LCD_720P_CONFIG_H__
#define __LCD_720P_CONFIG_H__


/*****************************************************************************
 * 720P摄像头(帧率主要看摄像头配置表,SDK默认1084 25帧)
 * 主码流(H264):1280x720 @ 25fps
 * 辅码流(H264):640x360  @ 25fps
 * 录卡(MP4):主码流+aac音频(8KHz/16bit)
 * 拍照(MJPG):1280x720
 * 图传:RTSP  辅码流  默认地址:rtsp://ip:554/h264?1
 * 回放:录风者采用下载模式去解码mp4回放
 * 文件系统:FAT32、EXFAT(配合ffconf.h设置)
 ****************************************************************************/

/***************************************************************
 * 打开PIN_FROM_PARAM,通过脚本和config.cfg去生成对应的io配置信息
 * 请查看重要的文件:pin_param.h、config.cfg两个文件
 *************************************************************/
#define PIN_FROM_PARAM
/*****************************************
 * 打开对应demo的宏
 ****************************************/
#define LCD_720P_DEMO

/**********************************************************************
 * 系统必要信息宏
 * CONFIG_PSRAM_AVHEAP_SIZE:为应用分配的psram宏,需要根据应用场景分配
 * PSRAM_HEAP:如果需要用到psram,需要打开PSRAM_HEAP
 ********************************************************************/
#define DEFAULT_SYS_CLK                 (192*1000000) 
#define PSRAM_HEAP          //如果需要psram当作heap,需要打开这个宏
#define AV_PSRAM_HEAP    
#define AV_HEAP

/*******************************************************************************************************************************************
1080P摄像头空间分配(如果没有其他要求,会将大部分空间给到视频)
H264：  I/P帧:3.1M+0.5M(默认,根据I帧P帧最大值进行调整)
		纯I帧:0.5M
		h264数据缓冲size: 64帧(最大缓冲)*100K(平局每一帧size) = 6M左右  (如果终端应用不会卡太久,这里可以分配2M-3M左右,这个是动态的)
		(64帧是最大缓冲数量,100K需要根据自己h264配置调整,缓冲帧数大是解决录卡不会轻易丢帧,参数都是可以调整,根据产品来调整)

MJPG(1路):  MJPG:  10-30(mjpg节点)*16K = 160K-480K  (不同分辨率以及质量需要调整,如果是大分辨率拍照4K、8K,需要1M

所以这里需要空间粗略计算就是 3.1M+0.5M+0.5M + 3M(h264+mjpg数据共用动态) ≈ 7M

由于MJPG与H264共用,会造成一定碎片化,可以适当将空间h264和MJPG独立分开,默认SDK没有分开
*********************************************************************************************************************************************/
#define CONFIG_PSRAM_AVHEAP_SIZE        (7*1024*1024+512*1024)

/**********************************************************************************************************************************************
 * 不同镜头以及功能不一样
 * 没有考虑大分辨拍照模式
 * 720P镜头:  60K(VPP_DATA0)(1080P h264) = 60k
			  辅码流:  12K(gen420) = 12K
			  其他:  10K(解码) + 其他(某些结构体用到) ≈ 15K
				
 * total:  90K(没有额外功能,可以运行,如果空间足够,尽量到100K)
 *********************************************************************************************************************************************/
#define CONFIG_AVHEAP_SIZE              (100*1024 + 50*1024)

/****************************************************************
 * wifi速率配置,根据不同场景需要距离等去配置特定速率算法
#define RATE_CONTROL_ERSHAO         1
#define RATE_CONTROL_HANGPAI        2
#define RATE_CONTROL_IPC            3
#define RATE_CONTROL_BABYMPNITOR    4
 ***************************************************************/
#define RATE_CONTROL_SELECT             3

/*****************************************************************
 * VCAM开关,部分io电源域需要打开才有电,参考pmu.h的头文件,这里列出几个电压
    VCAM_VOL_3V00,
    VCAM_VOL_3V05,
    VCAM_VOL_3V10,
    VCAM_VOL_3V15,
    VCAM_VOL_3V20,
    VCAM_VOL_3V25,
    VCAM_VOL_3V30,
 *****************************************************************/
#define VCAM_EN                         1
#define VCAM_VOL                        VCAM_VOL_2V80

/********************************************************************* 
VCAM2开关,部分io电源域需要打开才有电,参考pmu.h的头文件,这里列出几个电压
    VCC_LDO_VOL_1V70,
    VCC_LDO_VOL_1V75,
    VCC_LDO_VOL_1V80,
    VCC_LDO_VOL_1V85,
    VCC_LDO_VOL_1V90,
    VCC_LDO_VOL_1V95,
    VCC_LDO_VOL_2V00,
*****************************************************************/
#define VCAM2_EN                        1
#define VCAM2_VOL                       VCC_LDO_VOL_1V80


/*****************************************************************
 * 文件系统使能
 ***************************************************************/
#define FS_EN                           1

/************************************************************************************************************************
 * sensor型号配置,配置多个,支持自动识别(当前SDK只能支持全部单line或者双line,包含单line和双line需要对sdk初始化修改)
#define DEV_SENSOR_OV7725               0
#define DEV_SENSOR_OV7670               0
#define DEV_SENSOR_GC0308               0
#define DEV_SENSOR_OV2640               0
#define DEV_SENSOR_BF3A03               0
#define DEV_SENSOR_BF2013               0
#define DEV_SENSOR_OV2685               0
#define DEV_SENSOR_BF30A2               0
#define DEV_SENSOR_H62                  0
#define DEV_SENSOR_H63P                 0
#define DEV_SENSOR_SC1346               0
#define DEV_SENSOR_GC1084               0
#define DEV_SENSOR_GC2083               0
#define DEV_SENSOR_GC2053               0
#define DEV_SENSOR_SC2336P              0
#define DEV_SENSOR_SC2331               0
#define DEV_SENSOR_F38P                 0
#define DEV_SENSOR_F37P                 0
#define DEV_SENSOR_TP9950               0
 ***************************************************************************************************************************/
//#define DEV_SENSOR_SC1346               1
#define DEV_SENSOR_GC1084               1

/***********************************************************
 *默认mjpeg的节点数量,要根据mjpeg启动的分辨率去考虑
 默认节点大小:16*1024
 720P:算mjpeg大小50-80K,给10个节点足够
 1080P:算mjpeg大小100-150K,给20个节点足够
 其他分辨率,根据实际情况去配置
 * ********************************************************/
#define JPG_NODE_COUNT 30

/*************************************************************
 * 节省sram内存,将部分模块强制使用psram
 * 优点:节省sram内存
 * 缺点:psram读写慢,可能会影响性能
 
 1080P的sram内存不足,将部分数据放到了psram
 ************************************************************/
#define MORE_SRAM

/************************************************************************
* 配置MP4录制最大文件的size
 ************************************************************************/
#define MP4_MAX_SINGLE_SIZE (100 * 1024 * 1024)

/************************************************************************
* 开启文件系统优化
 ************************************************************************/
#define USE_FAT_CACHE 1

/************************************************************************
* 支持开机ota
************************************************************************* */
#define STARTUP_OTA   1

/************************************************************************
* 开启st7701s mipi支持
************************************************************************ */
#define LCD_ST7701S_MIPI_EN 1

#define DMA2D_EN 1

/***************************************************************************
* 支持的输入设备类型,暂时只有按键和触摸(LVGL_INDEY_KEY|LVGL_INDEY_TOUCHPAD)
************************************************************************** */
#define LVGL_INPUTDEV_SUPPORT (LVGL_INDEY_KEY)

/*************************************************************
 * 支持h264解码:SUPPORT_DECODER_H264
 * 支持jpeg解码:SUPPORT_DECODER_JPEG
 * 支持jpeg编码(通过yuv去编码mjpeg):SUPPORT_ENCODER_JPEG
 * 支持LCD:SUPPORT_LCD(支持video显示到屏)
 * 支持播放器:SUPPORT_TXMPLAYER
************************************************************ */
#define SUPPORT_DECODER_H264
#define SUPPORT_DECODER_JPEG
#define SUPPORT_ENCODER_JPEG
#define SUPPORT_LCD
#define SUPPORT_TXMPLAYER

/************************************************************
* 音频相关编码解码(参考audio_code_core.h)
*********************************************************** */
#define AAC_ENC_CTRL AUCODER_RUN_IN_CPU0
#define AAC_DEC_CTRL AUCODER_RUN_IN_CPU0


#endif
